/*
13.3. Алгоритм Бойера – Мура(6)
Требуется найти все вхождения образца в текстовом файле методом Бойера – Мура.
В файле нет переноса слов. Образец может включать пробелы и переходить с одной строки файла на другую.
Конец строки файла может интерпретироваться как пробел.Результаты поиска не должны зависеть от
регистра букв, то есть каждая буква в образце и файле может быть как строчной, так и прописной.
Ввод из файла INPUT.TXT.
Первая строка файла является образцом и имеет длину от 1 до 255.
Вторая строка задает имя текстового файла.Вывод в файл OUTPUT.TXT.
Вывести в каждой строке через пробел
последовательность номеров строк и позиций в строке, начиная с которых образец входит в текст.
Нумерация строк и позиций в строке начинается с 1. Если вхождений нет, вывести No.
*/
#include <iostream>

int main()
{
	return 0;
}
